#### Terraform Format and Style 🖌 (dev) `success`
#### Terraform Initialization ⚙️ (dev) `success`
#### Terraform Validation 🤖 (dev) `success`
#### Terraform Plan 📖 (dev) `success`

<details><summary>Show Plan (dev)</summary>

```terraform
module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_source: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbSourceRootToken-Q32b84]
module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_destination: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbDestinationRootToken-Q32b84]
module.secret_manager.aws_secretsmanager_secret_version.influxdb_backup_token_version_destination: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbDestinationRootToken-Q32b84|terraform-20250722123205366900000003]
module.secret_manager.aws_secretsmanager_secret_version.influxdb_backup_token_version_source: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbSourceRootToken-Q32b84|terraform-20250722123205379000000004]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_destination has been deleted
  - resource "aws_secretsmanager_secret" "influxdb_backup_token_destination" {
      - arn                            = "arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbDestinationRootToken-Q32b84" -> null
      - id                             = "arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbDestinationRootToken-Q32b84" -> null
        name                           = "revolution-staging-InfluxdbDestinationRootToken"
        # (8 unchanged attributes hidden)
    }

  # module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_source has been deleted
  - resource "aws_secretsmanager_secret" "influxdb_backup_token_source" {
      - arn                            = "arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbSourceRootToken-Q32b84" -> null
      - id                             = "arn:aws:secretsmanager:eu-west-2:339713055209:secret:revolution-staging-InfluxdbSourceRootToken-Q32b84" -> null
        name                           = "revolution-staging-InfluxdbSourceRootToken"
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_destination will be created
  + resource "aws_secretsmanager_secret" "influxdb_backup_token_destination" {
      + arn                            = (known after apply)
      + description                    = "the token created for the first user in the InfluxDB setup process"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "revolution-dev-InfluxdbDestinationRootToken"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "eu-west-2"
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.secret_manager.aws_secretsmanager_secret.influxdb_backup_token_source will be created
  + resource "aws_secretsmanager_secret" "influxdb_backup_token_source" {
      + arn                            = (known after apply)
      + description                    = "The token created for the first user in the InfluxDB setup process"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "revolution-dev-InfluxdbSourceRootToken"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "eu-west-2"
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.secret_manager.aws_secretsmanager_secret_version.influxdb_backup_token_version_destination will be created
  + resource "aws_secretsmanager_secret_version" "influxdb_backup_token_version_destination" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "eu-west-2"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secret_manager.aws_secretsmanager_secret_version.influxdb_backup_token_version_source will be created
  + resource "aws_secretsmanager_secret_version" "influxdb_backup_token_version_source" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "eu-west-2"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @daveacho, Action: `pull_request`, Workflow: `Terraform multi-environment deployments`, Environment: `dev`*